
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/nyshk97/aws-ecs-terraform/actions/runs/6259136857)



<pre><code>Apply complete! Resources: 7 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-083229c009d2de319]
data.aws_iam_policy_document.ecs_task_assume: Reading...
aws_ecr_repository.ecr_repository: Refreshing state... [id=go-simple-server]
data.aws_iam_policy_document.ecs_assume: Reading...
data.aws_iam_policy_document.ecs_task_assume: Read complete after 0s [id=1077804475]
data.aws_iam_policy_document.ecs_assume: Read complete after 0s [id=1077804475]
aws_ecr_lifecycle_policy.ecr_lifecycle_policy: Refreshing state... [id=go-simple-server]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0ded2aaadc5bb0224]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-07300af33a9c001a8]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0b6e7990e665c661f]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-0d03142caa758fc29]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0e2ae3c2ef6c9deac]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-07a38580cf08b9976]
aws_security_group.alb: Refreshing state... [id=sg-03345e2bb275c36d0]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0cb8be38df8114563]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-09f326f6a06eef180]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0581be1e8fb9f4a87]
aws_security_group.ecs: Refreshing state... [id=sg-0d988622b7767ecfd]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-01db1c87703bd6a1d]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0807f0dec95bec02b]
aws_lb_target_group.target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:413826436775:targetgroup/go-simple-server-target-group/de495f82d481b490]
aws_lb.alb: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:413826436775:loadbalancer/app/go-simple-server-alb/e7b741708e939369]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-09141fa82cbb4af19]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0183803c6e9b85e9b]
aws_security_group_rule.ecs_from_alb: Refreshing state... [id=sgrule-3223306409]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0b13f439843b02a26]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0cb8be38df81145631080289494]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-0f509b7de90ca1df0]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0734164d7a254ad13]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0a9c4fbae37afe4e5]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-01d5f76fbea4c8cac]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-039e20af860695e54]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0ded2aaadc5bb02241080289494]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-0d03142caa758fc291080289494]
aws_lb_listener.alb_listener: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:413826436775:listener/app/go-simple-server-alb/e7b741708e939369/5305c0d310d84cb1]
aws_lb_listener_rule.alb_listener_rule: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:413826436775:listener-rule/app/go-simple-server-alb/e7b741708e939369/5305c0d310d84cb1/bf80c2b56a7e5e6b]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.cloudwatch_log_group will be created
  + resource "aws_cloudwatch_log_group" "cloudwatch_log_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/ecs/go-simple-server"
      + name_prefix       = (known after apply)
      + retention_in_days = 1
      + skip_destroy      = false
      + tags_all          = (known after apply)
    }

  # aws_ecs_cluster.ecs_cluster will be created
  + resource "aws_ecs_cluster" "ecs_cluster" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "go-simple-server"
      + tags_all = (known after apply)
    }

  # aws_ecs_service.ecs_service will be created
  + resource "aws_ecs_service" "ecs_service" {
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 2
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "go-simple-server"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "go-simple-server"
          + container_port   = 8080
          + target_group_arn = "arn:aws:elasticloadbalancing:ap-northeast-1:413826436775:targetgroup/go-simple-server-target-group/de495f82d481b490"
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-0d988622b7767ecfd",
            ]
          + subnets          = [
              + "subnet-01db1c87703bd6a1d",
              + "subnet-0e2ae3c2ef6c9deac",
            ]
        }
    }

  # aws_ecs_task_definition.ecs_task_definition will be created
  + resource "aws_ecs_task_definition" "ecs_task_definition" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + environment      = [
                      + {
                          + name  = "HEALTH_CHECK_PATH"
                          + value = "/health_checks"
                        },
                      + {
                          + name  = "NGINX_PORT"
                          + value = "8080"
                        },
                    ]
                  + image            = "medpeer/health_check:latest"
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "/aws/ecs/go-simple-server"
                          + awslogs-region        = "ap-northeast-1"
                          + awslogs-stream-prefix = "go-simple-server"
                        }
                    }
                  + name             = "go-simple-server"
                  + portMappings     = [
                      + {
                          + containerPort = 8080
                          + hostPort      = 8080
                        },
                    ]
                },
            ]
        )
      + cpu                      = "256"
      + execution_role_arn       = (known after apply)
      + family                   = "go-simple-server"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags_all                 = (known after apply)
      + task_role_arn            = (known after apply)
    }

  # aws_iam_role.ecs will be created
  + resource "aws_iam_role" "ecs" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "go-simple-server-ecs"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role.ecs_task will be created
  + resource "aws_iam_role" "ecs_task" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "go-simple-server-ecs-task"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.ecs_basic will be created
  + resource "aws_iam_role_policy_attachment" "ecs_basic" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
      + role       = "go-simple-server-ecs"
    }

Plan: 7 to add, 0 to change, 0 to destroy.
aws_ecs_cluster.ecs_cluster: Creating...
aws_iam_role.ecs_task: Creating...
aws_cloudwatch_log_group.cloudwatch_log_group: Creating...
aws_iam_role.ecs: Creating...
aws_iam_role.ecs: Creation complete after 0s [id=go-simple-server-ecs]
aws_iam_role_policy_attachment.ecs_basic: Creating...
aws_iam_role.ecs_task: Creation complete after 0s [id=go-simple-server-ecs-task]
aws_iam_role_policy_attachment.ecs_basic: Creation complete after 0s [id=go-simple-server-ecs-20230921082821104100000001]
aws_cloudwatch_log_group.cloudwatch_log_group: Creation complete after 1s [id=/aws/ecs/go-simple-server]
aws_ecs_task_definition.ecs_task_definition: Creating...
aws_ecs_task_definition.ecs_task_definition: Creation complete after 1s [id=go-simple-server]
aws_ecs_cluster.ecs_cluster: Still creating... [10s elapsed]
aws_ecs_cluster.ecs_cluster: Creation complete after 12s [id=arn:aws:ecs:ap-northeast-1:413826436775:cluster/go-simple-server]
aws_ecs_service.ecs_service: Creating...
aws_ecs_service.ecs_service: Creation complete after 4s [id=arn:aws:ecs:ap-northeast-1:413826436775:service/go-simple-server/go-simple-server]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 7 added, 0 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":6,"Program":"tfcmt","SHA1":"cbe6c67f7740fe2a346bea6baa2e7d369a51d57d","Vars":{},"WorkflowName":"Terraform"} -->